In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
obj=Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj[0]

4

In [12]:
obj1=Series([4,7,-5,3],index=['d','b','c','a'])
obj1

d    4
b    7
c   -5
a    3
dtype: int64

In [15]:
obj1[['a','b','c']]

a    3
b    7
c   -5
dtype: int64

In [16]:
obj1>3

d     True
b     True
c    False
a    False
dtype: bool

In [17]:
obj1[obj1>3]

d    4
b    7
dtype: int64

In [18]:
obj1*3

d    12
b    21
c   -15
a     9
dtype: int64

In [22]:
sdata={'Daegu':2462,'Busan':3571,'Seoul':10102,'Daejeon':2906}
obj2=Series(sdata)
obj2

Daegu       2462
Busan       3571
Seoul      10102
Daejeon     2906
dtype: int64

In [23]:
city=['Incheon','Daegu','Seoul','Busan']
obj3=Series(sdata,index=city)
obj3

Incheon        NaN
Daegu       2462.0
Seoul      10102.0
Busan       3571.0
dtype: float64

In [24]:
pd.isnull(obj3)

Incheon     True
Daegu      False
Seoul      False
Busan      False
dtype: bool

In [25]:
pd.notnull(obj3)

Incheon    False
Daegu       True
Seoul       True
Busan       True
dtype: bool

In [26]:
obj3.isnull()

Incheon     True
Daegu      False
Seoul      False
Busan      False
dtype: bool

In [28]:
obj4=obj2+obj3
obj4

Busan       7142.0
Daegu       4924.0
Daejeon        NaN
Incheon        NaN
Seoul      20204.0
dtype: float64

In [29]:
obj4.values

array([ 7142.,  4924.,    nan,    nan, 20204.])

In [32]:
obj4['Daejeon']=1111
obj4

Busan       7142.0
Daegu       4924.0
Daejeon     1111.0
Incheon        NaN
Seoul      20204.0
dtype: float64

In [33]:
obj4.name='Population'
obj4

Busan       7142.0
Daegu       4924.0
Daejeon     1111.0
Incheon        NaN
Seoul      20204.0
Name: Population, dtype: float64

In [36]:
obj.index=['Apple','Banana','Kiwi','Orange']
obj

Apple     4
Banana    7
Kiwi     -5
Orange    3
dtype: int64

In [41]:
print('End practice of Series')
print("Start practice DataFrame")

End practice of Series
Start practice DataFrame

In [40]:
data={'city':['Seoul','Seoul','Seoul','Daegu','Daegu'],'year':[2010,2011,2012,2011,2012],'pop':[1.5,1.7,3.6,2.4,2.9]}
frame=DataFrame(data,columns=['year','city','pop','debt'],index=['one','two','three','four','five'])
frame

       year   city  pop debt
one    2010  Seoul  1.5  NaN
two    2011  Seoul  1.7  NaN
three  2012  Seoul  3.6  NaN
four   2011  Daegu  2.4  NaN
five   2012  Daegu  2.9  NaN

In [48]:
print(frame.iloc[1])
print('\n ==== \n')
print(frame.loc['two'])

year     2011
city    Seoul
pop       1.7
debt      NaN
Name: two, dtype: object

 ====

year     2011
city    Seoul
pop       1.7
debt      NaN
Name: two, dtype: object

In [51]:
print(frame.city)
print('\n ==== \n')
print(frame.year)
print('\n ==== \n')
print(frame.pop) #원래 있는 내장함수인 pop와 이름이 겹쳐 정렬이 잘 안 댐

one      Seoul
two      Seoul
three    Seoul
four     Daegu
five     Daegu
Name: city, dtype: object

 ====

one      2010
two      2011
three    2012
four     2011
five     2012
Name: year, dtype: int64

 ====

<bound method NDFrame.pop of        year   city  pop debt
one    2010  Seoul  1.5  NaN
two    2011  Seoul  1.7  NaN
three  2012  Seoul  3.6  NaN
four   2011  Daegu  2.4  NaN
five   2012  Daegu  2.9  NaN>

In [52]:
val=Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame['debt']=val
frame

       year   city  pop  debt
one    2010  Seoul  1.5   NaN
two    2011  Seoul  1.7  -1.2
three  2012  Seoul  3.6   NaN
four   2011  Daegu  2.4  -1.5
five   2012  Daegu  2.9  -1.7

In [53]:
frame['Eastern']=frame.city=='Daegu'
frame

       year   city  pop  debt  Eastern
one    2010  Seoul  1.5   NaN    False
two    2011  Seoul  1.7  -1.2    False
three  2012  Seoul  3.6   NaN    False
four   2011  Daegu  2.4  -1.5     True
five   2012  Daegu  2.9  -1.7     True

In [55]:
del(frame['Eastern'])
frame

KeyError: 'Eastern'

In [61]:
data.drop['five']
frame

AttributeError: 'dict' object has no attribute 'drop'

In [60]:
pop={'Daegu':{2011:2.4,2012:2.9},"Seoul":{2010:1.5,2011:1.7,2012:3.6}}
frame1=DataFrame(pop)
frame1

      Daegu  Seoul
2011    2.4    1.7
2012    2.9    3.6
2010    NaN    1.5

In [62]:
frame.loc[['three'],['city','year']]

        city  year
three  Seoul  2012

In [63]:
import numpy as np

In [64]:
frame=DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah    1.188509 -0.584684 -0.182587
Ohio    0.451838  0.608650  0.341940
Texas  -0.548021  1.022474  0.047566
Oregon  0.071118  0.910963 -0.357384

In [65]:
np.abs(frame)

               b         d         e
Utah    1.188509  0.584684  0.182587
Ohio    0.451838  0.608650  0.341940
Texas   0.548021  1.022474  0.047566
Oregon  0.071118  0.910963  0.357384

In [66]:
f=lambda x:x.max()-x.min()

In [67]:
frame.apply(f) #결과값은 열 단위

b    1.736530
d    1.607159
e    0.699324
dtype: float64

In [68]:
frame.apply(f,axis=1) #결과값은 행 단위

Utah      1.773194
Ohio      0.266711
Texas     1.570495
Oregon    1.268347
dtype: float64

In [72]:
def ff(x):
    return Series([x.min(),x.max()],index=['min','max'])

In [73]:
frame.apply(ff)

            b         d         e
min -0.548021 -0.584684 -0.357384
max  1.188509  1.022474  0.341940

In [74]:
numap=lambda x:'%.2f' %x

In [75]:
frame.applymap(numap)

            b      d      e
Utah     1.19  -0.58  -0.18
Ohio     0.45   0.61   0.34
Texas   -0.55   1.02   0.05
Oregon   0.07   0.91  -0.36

In [76]:
frame['e'].map(numap)

Utah      -0.18
Ohio       0.34
Texas      0.05
Oregon    -0.36
Name: e, dtype: object

In [79]:
ojk=Series([3,8,4,1],index=['b','d','a','c'])
ojk

b    3
d    8
a    4
c    1
dtype: int64

In [80]:
print(ojk.sort_index())
print(ojk.sort_values())

a    4
b    3
c    1
d    8
dtype: int64
c    1
b    3
a    4
d    8
dtype: int64

In [81]:
ojkk=Series(range(5),index=['a','a','b','b','c'])
ojkk

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [82]:
ojkk.index.is_unique

False

In [83]:
ojkk.index.unique

In [94]:
ojkk.unique()

array([0, 1, 2, 3, 4], dtype=int64)

In [90]:
ojk.describe()

count    4.00000
mean     4.00000
std      2.94392
min      1.00000
25%      2.50000
50%      3.50000
75%      5.00000
max      8.00000
dtype: float64

In [95]:
ojk.describe()[2]

2.943920288775949

In [96]:
data=DataFrame({'Qu1':[1,3,4,2,4,],
               'Qu2':[2,3,1,2,3],
               'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    2    2    4
4    4    3    4

In [98]:
result=data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  1.0  2.0  1.0
3  1.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [124]:
paed=pd.read_csv('D:\edu_pythonADV\heights.csv',sep=',')

In [125]:
paed

         earn     height     sex  ed  age   race
0     50000.0  74.424439    male  16   45  white
1     60000.0  65.537543  female  16   58  white
2     30000.0  63.629198  female  16   29  white
3     50000.0  63.108562  female  16   91  other
4     51000.0  63.402484  female  17   39  white
...       ...        ...     ...  ..  ...    ...
1187  19000.0  72.165733    male  12   29  white
1188  15000.0  61.135800  female  18   82  white
1189   8000.0  63.664164  female  12   33  white
1190  60000.0  71.925836    male  12   50  white
1191   6000.0  68.368486    male  12   27  white

[1192 rows x 6 columns]

In [114]:
paed.describe()

                earn       height           ed          age
count    1192.000000  1192.000000  1192.000000  1192.000000
mean    23154.773490    66.915154    13.504195    41.378356
std     19472.296925     3.853968     2.420175    15.867428
min       200.000000    57.503219     3.000000    18.000000
25%     10000.000000    64.009746    12.000000    29.000000
50%     20000.000000    66.451265    13.000000    38.000000
75%     30000.000000    69.848100    16.000000    51.000000
max    200000.000000    77.051282    18.000000    91.000000

In [108]:
paed.isnull().sum().sum()

0

In [113]:
paed.ed.head()

0    16
1    16
2    16
3    16
4    17
Name: ed, dtype: int64

In [123]:
from numpy import nan
paed.loc[1,'ed']=nan
#paed.set_index(['sex','race']).sort_values(by='race')
paed.set_index(['sex','race'],drop=False)

                 earn     height     sex    ed  age   race
sex    race
male   white  50000.0  74.424439    male  16.0   45  white
female white  60000.0  65.537543  female   NaN   58  white
       white  30000.0  63.629198  female  16.0   29  white
       other  50000.0  63.108562  female  16.0   91  other
       white  51000.0  63.402484  female  17.0   39  white
...               ...        ...     ...   ...  ...    ...
male   white  19000.0  72.165733    male  12.0   29  white
female white  15000.0  61.135800  female  18.0   82  white
       white   8000.0  63.664164  female  12.0   33  white
male   white  60000.0  71.925836    male  12.0   50  white
       white   6000.0  68.368486    male  12.0   27  white

[1192 rows x 6 columns]

In [133]:
ttr=pd.read_excel('D:\edu_pythonADV\Korean POS tags comparison chart.xlsx',header=0)
ttr

                    Unnamed: 0 Not provided in KoNLPy  ...  Unnamed: 21 Unnamed: 22
0                          NaN                    NaN  ...          NaN         NaN
1   Sejong project\n(ntags=42)                    NaN  ...          NaN     Example
2                          Tag            Description  ...  Description         NaN
3                          NNG                  일반 명사  ...       동작성 명사         NaN
4                          NaN                    NaN  ...       상태성 명사         NaN
..                         ...                    ...  ...          ...         ...
93                         NaN                    NaN  ...          NaN         NaN
94                         NaN                    NaN  ...          NaN         NaN
95                         NaN                    NaN  ...          NaN         NaN
96                         NaN                    NaN  ...          NaN         NaN
97                         NaN                    NaN  ...          NaN         NaN

[98 rows x 23 columns]

In [134]:
ttr.dropna(how='all',axis=0)

                    Unnamed: 0 Not provided in KoNLPy  ...  Unnamed: 21 Unnamed: 22
1   Sejong project\n(ntags=42)                    NaN  ...          NaN     Example
2                          Tag            Description  ...  Description         NaN
3                          NNG                  일반 명사  ...       동작성 명사         NaN
4                          NaN                    NaN  ...       상태성 명사         NaN
5                          NaN                    NaN  ...      비서술성 명사        어린이집
..                         ...                    ...  ...          ...         ...
93                         NaN                    NaN  ...          NaN         NaN
94                         NaN                    NaN  ...          NaN         NaN
95                         NaN                    NaN  ...          NaN         NaN
96                         NaN                    NaN  ...          NaN         NaN
97                         NaN                    NaN  ...          NaN         NaN

[97 rows x 23 columns]

In [148]:
skore=pd.read_excel('D:\edu_pythonADV\성적표.xls',index_col=0,header=0)
skore

    국어  수학  영어
철수  99  87  75
영희  89  56  12
보람  22  39  92

In [150]:
skore.describe()

              국어         수학         영어
count   3.000000   3.000000   3.000000
mean   70.000000  60.666667  59.666667
std    41.868843  24.337899  42.146570
min    22.000000  39.000000  12.000000
25%    55.500000  47.500000  43.500000
50%    89.000000  56.000000  75.000000
75%    94.000000  71.500000  83.500000
max    99.000000  87.000000  92.000000

In [152]:
pirst='1등!'
print(f'1등은 {pirst}입니다.')

1등은 1등!입니다.

In [172]:
skk=Series([skore.loc['철수'].sum(),skore.loc['영희'].sum(),skore.loc['보람'].sum()],index=['철수','영희','보람'])
skk

철수    261
영희    157
보람    153
dtype: int64

In [181]:
skk.rank().idxmax()

'철수'

In [ ]:
skore=pd.read_excel('D:\edu_pythonADV\성적표.xls',index_col=0,header=0)
skore
pirst='1등!'
skk=Series([skore.loc['철수'].sum(),skore.loc['영희'].sum(),skore.loc['보람'].sum()],index=['철수','영희','보람'])
pirst=skk.rank().idxmax()
print(f'1등은 {pirst}입니다.')

In [186]:
skore

    국어  수학  영어
철수  99  87  75
영희  89  56  12
보람  22  39  92

In [184]:
skore=pd.read_excel('D:\edu_pythonADV\성적표.xls',index_col=0,header=0)
pirst=skore.sum(axis=1).idxmax()
print(f'1등은 {pirst}입니다.')

1등은 철수입니다.

In [187]:
skore.sum(axis=1)

철수    261
영희    157
보람    153
dtype: int64

In [224]:
skore1=pd.read_excel('D:\edu_pythonADV\성적표.xls',index_col=0,header=0,sheet_name='1반')
skore2=pd.read_excel('D:\edu_pythonADV\성적표.xls',index_col=0,header=0,sheet_name='2반')
print(skore1)
print('\n ====== \n')
print(skore2)

    국어  수학  영어
철수  99  87  75
영희  89  56  12
보람  22  39  92

 ======

    국어  수학  영어
고움  99  87  77
또기  89  56  12
타조  22  39  92

In [200]:
pirst1=skore1.sum(axis=1).idxmax()
print(f'1반의 1등은 {pirst1}입니다.')
pirst2=skore2.sum(axis=1).idxmax()
print(f'2반의 1등은 {pirst2}입니다.')

1반의 1등은 철수입니다.
2반의 1등은 고움입니다.

In [211]:
#pirst=Series([skore1.sum(axis=1).max(),skore2.sum(axis=1).max()],\
#             index=[skore1.sum(axis=1).idxmax(),skore2.sum(axis=1).idxmax()]).idxmax()
pirst=pd.concat([skore1,skore2]).sum(axis=1).idxmax()
print(f'이 학년의 1등은 {pirst}입니다.')

이 학년의 1등은 고움입니다.

In [205]:
skore1['반']=1
skore1

    국어  수학  영어  반
철수  99  87  75  1
영희  89  56  12  1
보람  22  39  92  1

In [206]:
skore2['반']=2
skore2

    국어  수학  영어  반
고움  99  87  77  2
또기  89  56  12  2
타조  22  39  92  2

In [207]:
skore1.sum(axis=1)[:1]

철수    262
dtype: int64

In [209]:
skore2.국어

고움    99
또기    89
타조    22
Name: 국어, dtype: int64

In [210]:
skore1[피자]=[치즈,불고기,파인애플]

NameError: name '치즈' is not defined

In [225]:
skole1=pd.read_excel('D:\edu_pythonADV\성적표.xlsx',index_col=0,header=1,sheet_name='1반')
skole2=pd.read_excel('D:\edu_pythonADV\성적표.xlsx',index_col=1,header=2,sheet_name='2반')
print(skole1)
print('\n ====== \n')
print(skole2)

    국어  영어  수학
철수  46  43  76
영희  54  23  31
보람  94  23  76

 ======

     Unnamed: 0    국어    영어    수학
NaN         NaN   NaN   NaN   NaN
유영          NaN  94.0  43.0  76.0
상일          NaN  54.0  56.0  31.0
조영          NaN  43.0  23.0   NaN

In [234]:
skole2=skole2.dropna(how='all',axis=1)
skole2=skole2.dropna(how='all',axis=0)
skole2=skole2.fillna(0)
skole2

      국어    영어    수학
유영  94.0  43.0  76.0
상일  54.0  56.0  31.0
조영  43.0  23.0   0.0

In [235]:
skole1+skole2

    국어  영어  수학
보람 NaN NaN NaN
상일 NaN NaN NaN
영희 NaN NaN NaN
유영 NaN NaN NaN
조영 NaN NaN NaN
철수 NaN NaN NaN

In [240]:
skole1=pd.read_excel('D:\edu_pythonADV\성적표.xlsx',index_col=0,header=1,sheet_name='1반')
skole2=pd.read_excel('D:\edu_pythonADV\성적표.xlsx',index_col=1,header=2,sheet_name='2반')
print(skole1)
print('\n ====== \n')
print(skole2)
skole2=skole2.dropna(how='all',axis=1).dropna(how='all',axis=0).fillna(0)
print('\n ====== \n')
print(skole2)
print('\n ====== \n')
pirst1=skole1.sum(axis=1).idxmax()
print(f'1반의 1등은 {pirst1}입니다.')
pirst2=skole2.sum(axis=1).idxmax()
print(f'2반의 1등은 {pirst2}입니다.')
#pirst=Series([skore1.sum(axis=1).max(),skore2.sum(axis=1).max()],\
#             index=[skore1.sum(axis=1).idxmax(),skore2.sum(axis=1).idxmax()]).idxmax()
pirst=pd.concat([skole1,skole2]).sum(axis=1).idxmax()
print(f'이 학년의 1등은 {pirst}입니다.')

    국어  영어  수학
철수  46  43  76
영희  54  23  31
보람  94  23  76

 ======

     Unnamed: 0    국어    영어    수학
NaN         NaN   NaN   NaN   NaN
유영          NaN  94.0  43.0  76.0
상일          NaN  54.0  56.0  31.0
조영          NaN  43.0  23.0   NaN

 ======

      국어    영어    수학
유영  94.0  43.0  76.0
상일  54.0  56.0  31.0
조영  43.0  23.0   0.0

 ======

1반의 1등은 보람입니다.
2반의 1등은 유영입니다.
이 학년의 1등은 유영입니다.